ASCII -> mermaid
